As of 1.58.0 my resource is attempting to be created even with an ignore on the ssh_keys.

```
resource "hcloud_storage_box" "data" {
  name              = "Data"
  storage_box_type  = "bx11"
  location          = "fsn1"
  password          = "fakepassword"
  delete_protection = true

  snapshot_plan = {
    hour          = 12
    max_snapshots = 10
    minute        = 0
  }

  lifecycle {
    ignore_changes = [
      password,
      ssh_keys,
    ]
  }
}
```

results in

```
  # hcloud_storage_box.data must be replaced
-/+ resource "hcloud_storage_box" "data" {
      ~ id                = XXXXXX -> (known after apply)
        name              = "Data"
      + password          = (sensitive value)
      ~ server            = "uXXXXXX.your-storagebox.de" -> (known after apply)
      + ssh_keys          = [] # forces replacement
      ~ system            = "FSN1-BX1644" -> (known after apply)
      ~ username          = "uXXXXXX" -> (known after apply)
        # (6 unchanged attributes hidden)
    }
````


```
tofu providers

Providers required by configuration:
.
├── provider[registry.opentofu.org/hashicorp/assert] 0.16.0
├── provider[registry.opentofu.org/hetznercloud/hcloud] 1.58.0
├── provider[registry.opentofu.org/hashicorp/local] 2.6.1
├── provider[registry.opentofu.org/hashicorp/random] 3.7.2
└── provider[registry.opentofu.org/tailscale/tailscale] 0.24.0

Providers required by state:

    provider[registry.opentofu.org/hetznercloud/hcloud]

    provider[registry.opentofu.org/tailscale/tailscale]
```

Anything I missed?

-- edit

cc @apricote 